# Pandas - Data Frames

DataFrames con diccionarios:

In [2]:
import pandas as pd
import numpy as np

data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Modificar el orden de las columnas:

In [3]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

Análisis preliminar de datos:

In [7]:
df = pd.read_csv('adult_data.csv')
df.shape  # Ver la cantidad de filas y columnas

(32561, 15)

In [8]:
df.head(3) #Visualizar los primeros 3 registros
#df.tail(3) --> Ver los último 3 registros

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K

In [9]:
df.dtypes #Columnas con el tipo de dato

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country    object
salary            object
dtype: object

In [11]:
df1 = df[['age', 'education', 'occupation', 'sex', 'salary']] #DF con las columnas elegidas
df1.head(5)

   age  education         occupation     sex salary
0   39  Bachelors       Adm-clerical    Male  <=50K
1   50  Bachelors    Exec-managerial    Male  <=50K
2   38    HS-grad  Handlers-cleaners    Male  <=50K
3   53       11th  Handlers-cleaners    Male  <=50K
4   28  Bachelors     Prof-specialty  Female  <=50K

Trabajar con datos faltantes:

In [12]:
dfTitanic = pd.read_csv('titanic.csv')
dfTitanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
dfTitanic.describe() #Estadística por cada columnna. Medidas de tendencia central y medidas de dispersión

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
dfTitanic.shape

(891, 12)

In [15]:
dfTitanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Eliminar filas con NaN:

In [17]:
#titanic1 = dfTitanic.dropna(axis = 0, how = 'all') --> Elimina filas que posean NaN en TODAS sus columnas
titanic1 = dfTitanic.dropna(axis = 0, how = 'any') #Elimina filas que posean AL MENOS un NaN
titanic1.shape

(183, 12)

Rellenar datos NaN: